Limpieza y tranformacion de Tatos

In [1]:
# importe de librairies
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
salaries = pd.read_csv('datasets/linkedin-jobs-usa.csv')

In [3]:
salaries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2845 entries, 0 to 2844
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   title          2845 non-null   object
 1   company        2845 non-null   object
 2   description    2845 non-null   object
 3   onsite_remote  2845 non-null   object
 4   salary         929 non-null    object
 5   location       2845 non-null   object
 6   criteria       2845 non-null   object
 7   posted_date    2845 non-null   object
 8   link           2845 non-null   object
dtypes: object(9)
memory usage: 200.2+ KB

---
## Tratamiento de duplicados

In [ ]:
salaries.drop_duplicates() #Este es para eliminar todos los duplicados

In [4]:
salaries_limpieza = salaries.copy()

In [5]:
salaries_limpieza.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
2840    False
2841    False
2842    False
2843    False
2844    False
Length: 2845, dtype: bool

In [7]:
salaries_limpieza.duplicated().sum()

0

In [9]:
salaries_limpieza[salaries_limpieza.duplicated()]

Empty DataFrame
Columns: [title, company, description, onsite_remote, salary, location, criteria, posted_date, link]
Index: []

In [10]:
salaries_limpieza.drop_duplicates()

,title,company,description,onsite_remote,salary,location,criteria,posted_date,link
0,Data Analyst - Recent Graduate,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,Buffalo-Niagara Falls Area,"[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-22,https://www.linkedin.com/jobs/view/data-analys...
1,Data Analyst - Recent Graduate,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,"San Jose, CA","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-22,https://www.linkedin.com/jobs/view/data-analys...
2,Data Analyst,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,"Texas, United States","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-17,https://www.linkedin.com/jobs/view/data-analys...
3,Data Analyst,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,"Illinois, United States","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-17,https://www.linkedin.com/jobs/view/data-analys...
4,Entry-Level Data Analyst,The Federal Savings Bank,"The Federal Savings Bank, a national bank and ...",onsite,NaN,"Chicago, IL","[{'Seniority level': 'Entry level'}, {'Employm...",2022-11-17,https://www.linkedin.com/jobs/view/entry-level...
...,...,...,...,...,...,...,...,...,...
2840,Junior Data Analyst,Iris Software Inc.,"Iris's client, one of the world's largest fina...",hybrid,NaN,"Texas, United States","[{'Seniority level': 'Mid-Senior level'}, {'Em...",2022-10-21,https://www.linkedin.com/jobs/view/junior-data...
2841,Data Analyst (SQL),Marwood Group,The Marwood Group (Marwood) is a leading healt...,hybrid,"$75,000.00\r\n -\r\n $95...",New York City Metropolitan Area,"[{'Seniority level': 'Mid-Senior level'}, {'Em...",2022-10-26,https://www.linkedin.com/jobs/view/data-analys...
2842,Data Analyst,SmartSense by Digi,"Join a high-performing, tight-knit team at a f...",hybrid,NaN,"Mishawaka, IN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-17,https://www.linkedin.com/jobs/view/data-analys...
2843,Data Analyst,Synergy Search,Nashville (Berry Hill) based company looking t...,hybrid,"$85,000.00\r\n -\r\n $95...",Nashville Metropolitan Area,"[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-14,https://www.linkedin.com/jobs/view/data-analys...
2844,Data Analyst,Insight Global,Overview - Minimum 5 years in a quantitative d...,hybrid,"$130,000.00\r\n -\r\n $1...","Burbank, CA","[{'Seniority level': 'Mid-Senior level'}, {'Em...",2022-11-14,https://www.linkedin.com/jobs/view/data-analys...

---
## Tratamiento de valores nulos NaN
-   Visualizar los valores nulos

In [12]:
salaries_limpieza.isna()

,title,company,description,onsite_remote,salary,location,criteria,posted_date,link
0,False,False,False,False,True,False,False,False,False
1,False,False,False,False,True,False,False,False,False
2,False,False,False,False,True,False,False,False,False
3,False,False,False,False,True,False,False,False,False
4,False,False,False,False,True,False,False,False,False
...,...,...,...,...,...,...,...,...,...
2840,False,False,False,False,True,False,False,False,False
2841,False,False,False,False,False,False,False,False,False
2842,False,False,False,False,True,False,False,False,False
2843,False,False,False,False,False,False,False,False,False
2844,False,False,False,False,False,False,False,False,False

In [13]:
print(f'Valores NaN por columna:\n{salaries_limpieza.isna().sum()}')

Valores NaN por columna:
title               0
company             0
description         0
onsite_remote       0
salary           1916
location            0
criteria            0
posted_date         0
link                0
dtype: int64

In [14]:
df_sin_nulos = salaries.dropna() # Elimina todas las filas que tienen al menos un valor nulo
df_sin_nulos.info() # Elimina todas las filas que tienen al menos un valor nulo en la columna especificada

<class 'pandas.core.frame.DataFrame'>
Int64Index: 929 entries, 8 to 2844
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   title          929 non-null    object
 1   company        929 non-null    object
 2   description    929 non-null    object
 3   onsite_remote  929 non-null    object
 4   salary         929 non-null    object
 5   location       929 non-null    object
 6   criteria       929 non-null    object
 7   posted_date    929 non-null    object
 8   link           929 non-null    object
dtypes: object(9)
memory usage: 72.6+ KB

In [18]:
df_sin_nulos.shape

(929, 9)

In [15]:
df_sin_nulos.isna().sum()

title            0
company          0
description      0
onsite_remote    0
salary           0
location         0
criteria         0
posted_date      0
link             0
dtype: int64

In [17]:
df_sin_nulos['salary'].head()

8     $100,000.00\r\n            -\r\n            $1...
24    $50,000.00\r\n            -\r\n            $55...
35    $100,000.00\r\n            -\r\n            $1...
61    $100,000.00\r\n            -\r\n            $1...
88    $100,000.00\r\n            -\r\n            $1...
Name: salary, dtype: object

In [ ]:
# Axis 0 es filas, axis 1 es columnas
# Axis 1 es para eliminar columnas

#   df_sin_nulos_columna = salaries.dropna(axis=0, how='any') # Elimina todas las filas que tienen al menos un valor nulo
#   df_sin_nulos_columna = salaries.dropna(axis=0, how='all') # Elimina todas las filas que tienen todos los valores nulos
#   df_sin_nulos_columna = salaries.dropna(axis=1, how='any') # Elimina todas las columnas que tienen al menos un valor nulo
#   df_sin_nulos_columna = salaries.dropna(axis=1, how='all') # Elimina todas las columnas que tienen todos los valores nulos

In [ ]:
df_sin_nulos_columna = salaries.dropna(axis=1, how='any') # Elimina todas las columnas que tienen al menos un valor nulo

---
# Trasformacion de datos

-   2da opcion `Remplazar NaNs por la media`

In [21]:
df_sin_nulos['salary']

8       $100,000.00\r\n            -\r\n            $1...
24      $50,000.00\r\n            -\r\n            $55...
35      $100,000.00\r\n            -\r\n            $1...
61      $100,000.00\r\n            -\r\n            $1...
88      $100,000.00\r\n            -\r\n            $1...
                              ...
2834        $30.00\r\n            -\r\n            $33.00
2836    $120,000.00\r\n            -\r\n            $1...
2841    $75,000.00\r\n            -\r\n            $95...
2843    $85,000.00\r\n            -\r\n            $95...
2844    $130,000.00\r\n            -\r\n            $1...
Name: salary, Length: 929, dtype: object

In [22]:
##  Este código toma una columna 'salary' que contiene valores de salario en formato de cadena, 
##  elimina cualquier caracter no numérico, extrae los dígitos y convierte la columna resultante en valores numéricos de tipo float. 
##   El resultado se almacena en una nueva columna llamada 'salary_numeric'. 
##  Esto es útil cuando la columna 'salary' inicial contiene caracteres no numéricos y se desea trabajar con los salarios como valores numéricos.


df_sin_nulos['salary_numeric'] = df_sin_nulos['salary'].str.replace(r'\D', '', regex=True).astype(float)

##df_sin_nulos['salary_numeric'] = df_sin_nulos['salary'].replace('[^\d.]', '', regex=True).str.extract('(\d+)').astype(float)

d:\Archivos\Archivos de Programas\miniconda3\envs\MiEntornoEVND\lib\site-packages\ipykernel_launcher.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  import sys